"""
개념정리
list, for, while을 설명하시오
"""

"""
난이도 ★☆☆☆☆☆☆☆☆☆
a = [4, 7, 3, 8, 2, 9, 4, 5, 1, 6]
a의 모든 값을 출력하시오.
a의 길이를 출력하시오.
"""

"""
난이도 ★★✬☆☆☆☆☆☆☆
a = [4, 7, 3, 8, 2, 9, 4, 5, 1, 6]
a에서 5를 찾고 5의 번호를 구하시오.
"""

"""
난이도 ★★★✬☆☆☆☆☆☆
숫자 맞추기 게임
숫자 하나를 지정하시오. 23으로 지정을 하겠다.
사용자에게 숫자를 입력 받는다.
만약 사용자가 입력한 숫자가 지정한 숫자보다 크면 "너무 커요"를 출력한다.
만약 사용자가 입력한 숫자가 지정한 숫자보다 작으면 "너무 작아요"를 출력한다.
만약 사용자가 입력한 숫자가 지정한 숫자와 같으면 "정답입니다."를 출력한다.
이것을 계속 반복한다.
만약 정답을 맞출 경우 "정답입니다."를 출력하고 반복을 멈춘다.
hint) break, if, elif else사용
while True:사용
"""

"""
난이도 ★★★★★✬☆☆☆☆
a = [4, 7, 3, 8, 2, 9, 4, 5, 1, 6]
순서대로 정렬하시오.
즉 a = [1, 2, 3, 4, 4, 5, 6, 7, 8, 9]가 되도록 하시오.

hint) 1번이 더 간단하다.
방법1:   a를 하나씩 보고 가장 작은 값을 새로운 리스트에 넣는다.
        그리고 a에서 그 값을 뺀다.
        이를 반복한다.

방법2: 1번, 2번을 비교해서 작은 값을 새로운 리스트에 넣는다.
        이를 반복한다.
"""